---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.IsEmbedded
source: html/5d87f88a-4d97-baeb-7cf8-7d2991db5a75.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsEmbedded Property

Indicates if this is an embedded ScheduleDefinition.

## Syntax (C#)
```csharp
public bool IsEmbedded { get; }
```